app/views/listings/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
---
                        <tbody style="text-align: center;">
                            <% @food.user.listings.each do |listing| %>