app/controllers/listings_controller.rb

SELECT "listings".* FROM "listings"  ORDER BY created_at DESC
---
  def index
    @tools = Listing.all.order('created_at DESC')

INSERT INTO "listings" ("tool", "price", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @tool = current_user.listings.build(query_p)
    if @tool.save

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @tool = Listing.find(params[:id])

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT 1  [["id", 4]]
---
  def edit
    @tool = Listing.find(params[:id])

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "listings" SET "tool" = ?, "updated_at" = ? WHERE "listings"."id" = ?  [["tool", "Organic Heirloom Tomatoes (1 lbs)"], ["updated_at", "2016-07-21 00:36:21.439544"], ["id", 6]]
---
  def update
    @tool = Listing.find(params[:id])
    if @tool.update(query_p)

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT 1  [["id", 3]]
---
  def find_post
    @tool = Listing.find(params[:id])